lo22/angle_30_slope_proc4_modelHB_turbRAS_3.0.1_hex_nonorthohonal_model/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	object	blockMeshDict;
}
convertToMeters 1;
vertices
(
	(0		0		577)		// 0
	(1000	0		0)			// 1
	(1000	500		0)			// 2
	(0		500		577)		// 3
	(0		0		597)		// 4
	(1000	0		20)			// 5
	(1000	500		20)			// 6
	(0		500		597)		// 7
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (200 100 4) simpleGrading (1 1 1) // 0
	//hex (0 1 2 3 4 5 6 7) (100 50 2) simpleGrading (1 1 1) // 0
);

edges
(
);

boundary
(
	sides
	{
		type patch;
		faces
		(
			(0 1 5 4)		// 0
			(1 2 6 5)		// 1
			(2 3 7 6)		// 2
			(3 0 4 7)		// 3
		);
	}

	slope
	{
		type wall;
		faces
		(
			(0 3 2 1)		// 0
		);
	}
	atmosphere
	{
		type patch;
		faces
		(
			(4 5 6 7)		// 0
		);
	}
);

mergePatchPairs
(
);
